In [19]:
#남북한발전전력량  파일
#묵한의 신재생 값은 0
# 각 에너지들의 평균
import pandas as pd
a=pd.read_excel('../dataFiles/남북한발전전력량.xlsx',engine='openpyxl')

In [20]:
a.loc[9,:]='-'
a.loc[9,'전력량 (억㎾h)']='NaN'
a.loc[9,'발전 전력별']='신재생'
a.replace('-',0,inplace=True)
b=a.T.iloc[2:].astype('int')
a['평균']=b.describe().loc['mean']
a

,전력량 (억㎾h),발전 전력별,1990,1991,1992,1993,1994,1995,1996,1997,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,평균
0,남한,합계,1077,1186,1310,1444,1650,1847,2055,2244,...,4224,4336,4747,4969,5096,5171,5220,5281,5404,3278.629630
1,NaN,수력,64,51,49,60,41,55,52,54,...,56,56,65,78,77,84,78,58,66,59.222222
2,NaN,화력,484,573,696,803,1022,1122,1264,1420,...,2658,2802,3196,3343,3430,3581,3427,3402,3523,2042.074074
3,NaN,원자력,529,563,565,581,587,670,739,771,...,1510,1478,1486,1547,1503,1388,1564,1648,1620,1150.629630
4,NaN,신재생,0,0,0,0,0,0,0,0,...,0,0,0,0,86,118,151,173,195,26.777778
5,북한,합계,277,263,247,221,231,230,213,193,...,255,235,237,211,215,221,216,190,239,219.037037
6,NaN,수력,156,150,142,133,138,142,125,107,...,141,125,134,132,135,139,130,100,128,126.222222
7,NaN,화력,121,113,105,88,93,88,88,86,...,114,110,103,79,80,82,86,90,111,92.814815
8,NaN,원자력,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0.000000
9,NaN,신재생,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0.000000

# 2장

In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('../data/gapminder.tsv',sep='\t')

In [4]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [5]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.shape

(1704, 6)

In [8]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [9]:
df.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [12]:
country_df=df['country']
type(country_df)

pandas.core.series.Series

In [13]:
country_df.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [15]:
subset=df[['country','continent','year']]
type(subset)

pandas.core.frame.DataFrame

In [18]:
subset.head(),subset.tail()

(       country continent  year
 0  Afghanistan      Asia  1952
 1  Afghanistan      Asia  1957
 2  Afghanistan      Asia  1962
 3  Afghanistan      Asia  1967
 4  Afghanistan      Asia  1972,
        country continent  year
 1699  Zimbabwe    Africa  1987
 1700  Zimbabwe    Africa  1992
 1701  Zimbabwe    Africa  1997
 1702  Zimbabwe    Africa  2002
 1703  Zimbabwe    Africa  2007)

In [22]:
df.loc[0],df.loc[99]

(country      Afghanistan
 continent           Asia
 year                1952
 lifeExp           28.801
 pop              8425333
 gdpPercap        779.445
 Name: 0, dtype: object,
 country      Bangladesh
 continent          Asia
 year               1967
 lifeExp          43.453
 pop            62821884
 gdpPercap       721.186
 Name: 99, dtype: object)

In [23]:
df.loc[-1]

KeyError: -1

In [25]:
number_of_rows = df.shape[0]
last_row_index = number_of_rows - 1

df.loc[last_row_index]

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [26]:
df.tail(n=1)

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [27]:
df.loc[[0,99,999]]

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [29]:
subset_loc = df.loc[0] 
subset_tail = df.tail(n=1)

type(subset_loc),type(subset_tail)

(pandas.core.series.Series, pandas.core.frame.DataFrame)

In [31]:
df.iloc[1],df.iloc[99]

(country      Afghanistan
 continent           Asia
 year                1957
 lifeExp           30.332
 pop              9240934
 gdpPercap        820.853
 Name: 1, dtype: object,
 country      Bangladesh
 continent          Asia
 year               1967
 lifeExp          43.453
 pop            62821884
 gdpPercap       721.186
 Name: 99, dtype: object)

In [32]:
df.iloc[-1]

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [33]:
df.iloc[[0,99,999]]

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [35]:
subset = df.loc[:, ['year', 'pop']] 
subset.head()

   year       pop
0  1952   8425333
1  1957   9240934
2  1962  10267083
3  1967  11537966
4  1972  13079460

In [36]:
subset = df.iloc[:, [2, 4, -1]] 
subset.head()

   year       pop   gdpPercap
0  1952   8425333  779.445314
1  1957   9240934  820.853030
2  1962  10267083  853.100710
3  1967  11537966  836.197138
4  1972  13079460  739.981106

In [38]:
small_range = list(range(5)) 
small_range
type(small_range)

list

In [39]:
subset=df.iloc[:,small_range]
subset.head()

       country continent  year  lifeExp       pop
0  Afghanistan      Asia  1952   28.801   8425333
1  Afghanistan      Asia  1957   30.332   9240934
2  Afghanistan      Asia  1962   31.997  10267083
3  Afghanistan      Asia  1967   34.020  11537966
4  Afghanistan      Asia  1972   36.088  13079460

In [40]:
small_range = list(range(3,6)) 
small_range

[3, 4, 5]

In [41]:
subset=df.iloc[:,small_range]
subset.head()

   lifeExp       pop   gdpPercap
0   28.801   8425333  779.445314
1   30.332   9240934  820.853030
2   31.997  10267083  853.100710
3   34.020  11537966  836.197138
4   36.088  13079460  739.981106

In [42]:
small_range = list(range(0,6,2))
subset=df.iloc[:,small_range]
subset.head()

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083
3  Afghanistan  1967  11537966
4  Afghanistan  1972  13079460

In [43]:
subset=df.iloc[:,:3]
subset.head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [44]:
subset=df.iloc[:,0:6:2]
subset.head()

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083
3  Afghanistan  1967  11537966
4  Afghanistan  1972  13079460

In [45]:
df.iloc[[0,99,999],[0,3,5]]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [46]:
df.loc[[0,99,999],['country','lifeExp','gdpPercap']]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [47]:
df.loc[10:13,['country','lifeExp','gdpPercap']]

        country  lifeExp    gdpPercap
10  Afghanistan   42.129   726.734055
11  Afghanistan   43.828   974.580338
12      Albania   55.230  1601.056136
13      Albania   59.280  1942.284244

# 3장

In [48]:
s = pd.Series(['banana', 42])
s

0    banana
1        42
dtype: object

In [49]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'])
s

0         Wes McKinney
1    Creator of Pandas
dtype: object

In [50]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'], index=['Person', 'Who'])
s

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [51]:
scientists = pd.DataFrame({'Name': ['Rosaline Franklin','William Gosset'], 
                            'Occupation': ['Chemist','Statistician'], 
                            'Born': ['1920-07-25','1876-06-13'], 
                            'Died': ['1958-04-16','1937-10-16'], 
                            'Age': [37,61]}) 
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [56]:
scientists = pd.DataFrame(data={'Occupation': ['Chemist','Statistician'], 
                                'Born': ['1920-07-25','1876-06-13'], 
                                'Died': ['1958-04-16','1937-10-16'],
                                'Age': [37,61]},
                        index=['Rosaline Franklin','William Gosset'],
                        columns=['Occupation','Born','Age','Died']) 
scientists

                     Occupation        Born  Age        Died
Rosaline Franklin       Chemist  1920-07-25   37  1958-04-16
William Gosset     Statistician  1876-06-13   61  1937-10-16

In [54]:
from collections import OrderedDict
scientists = pd.DataFrame(OrderedDict([('Name', ['Rosaline Franklin','William Gosset']),
                                        ('Occupation', ['Chemist','Statistician']), 
                                        ('Born', ['1920-07-25','1876-06-13']), 
                                        ('Died', ['1958-04-16','1937-10-16']), 
                                        ('Age', [61,37])])) 
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   61
1     William Gosset  Statistician  1876-06-13  1937-10-16   37

In [59]:
scientists = pd.DataFrame(data={'Occupation': ['Chemist','Statistician'], 
                                'Born': ['1920-07-25','1876-06-13'], 
                                'Died': ['1958-04-16','1937-10-16'],
                                'Age': [37,61]},
                        index=['Rosaline Franklin','William Gosset'],
                        columns=['Occupation','Born','Died','Age']) 
scientists

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

In [61]:
first_row = scientists.loc['William Gosset'] 
type(first_row),first_row

(pandas.core.series.Series,
 Occupation    Statistician
 Born            1876-06-13
 Died            1937-10-16
 Age                     61
 Name: William Gosset, dtype: object)

In [62]:
first_row.index

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [63]:
first_row.values

array(['Statistician', '1876-06-13', '1937-10-16', 61], dtype=object)

In [64]:
first_row.keys()

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [65]:
first_row.index[0]

'Occupation'

In [66]:
first_row.keys()[0]

'Occupation'

In [67]:
ages=scientists['Age']
ages

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [68]:
ages.mean(),ages.min(),ages.max(),ages.std()

(49.0, 37, 61, 16.97056274847714)

In [69]:
scientists = pd.read_csv('../data/scientists.csv')

In [70]:
ages=scientists['Age']
ages.max(), ages.mean()

(90, 59.125)

In [72]:
ages[ages>ages.mean()],ages>ages.mean()

(1    61
 2    90
 3    66
 7    77
 Name: Age, dtype: int64,
 0    False
 1     True
 2     True
 3     True
 4    False
 5    False
 6    False
 7     True
 Name: Age, dtype: bool)

In [74]:
manual_bool_values = [True,True,False,False,True,True,False,True] 
ages[manual_bool_values]

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

In [75]:
ages+ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [76]:
ages*ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [78]:
ages+100,ages*2

(0    137
 1    161
 2    190
 3    166
 4    156
 5    145
 6    141
 7    177
 Name: Age, dtype: int64,
 0     74
 1    122
 2    180
 3    132
 4    112
 5     90
 6     82
 7    154
 Name: Age, dtype: int64)

In [79]:
pd.Series([1,10])

0     1
1    10
dtype: int64

In [80]:
ages+pd.Series([1,10])

0    38.0
1    71.0
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
dtype: float64

In [81]:
ages.sort_index(ascending=False)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [83]:
ages*2,ages+ages.sort_index(ascending=False)

(0     74
 1    122
 2    180
 3    132
 4    112
 5     90
 6     82
 7    154
 Name: Age, dtype: int64,
 0     74
 1    122
 2    180
 3    132
 4    112
 5     90
 6     82
 7    154
 Name: Age, dtype: int64)

In [91]:
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [93]:
scientists.loc[[True, True, False, True]] # ?????????????

IndexError: Boolean index has wrong length: 4 instead of 8

In [88]:
scientists*2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

In [96]:
print(scientists['Born'].dtype)

object

In [95]:
scientists['Died'].dtype

dtype('O')

In [97]:
born_datetime=pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [100]:
Died_datetime=pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
Died_datetime

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [102]:
scientists['born_dt'], scientists['died_dt'] = (born_datetime, Died_datetime)
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [104]:
scientists['age_day']=(scientists['died_dt']-scientists['born_dt'])
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_day
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [105]:
scientists['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [108]:
import random
random.seed(42)
random.shuffle(scientists['Age'])
scientists['Age']

0    61
1    41
2    66
3    56
4    37
5    45
6    77
7    90
Name: Age, dtype: int64

In [109]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'age_day'],
      dtype='object')

In [110]:
scientists.drop('Age',axis=1,inplace=True)

In [111]:
scientists

,Name,Born,Died,Occupation,born_dt,died_dt,age_day
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

In [112]:
names=scientists['Name']
names.to_pickle('s_n.pickle')

In [113]:
scientists.to_pickle('s.pickle')

In [114]:
s_n_f=pd.read_pickle('s.pickle')
s_n_f

,Name,Born,Died,Occupation,born_dt,died_dt,age_day
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

In [115]:
names.to_csv('n.csv')

In [116]:
scientists.to_csv('s_d.tsv')

In [117]:
names_df=names.to_frame()